/*
********************************************************************************
File name  : ZXT_clear_dtc.h
Description: 该头文件主要是Creardtc.c中相关变量和函数声明,不允许在这里放置无关信息
History    :
修改日期   : 修改者 : 修改内容:简单详述
2012-4-19    小老鼠   建立创建通讯连接相关函数，变量声明
修改日期   : 修改者 : 修改内容:简单详述
********************************************************************************
*/

#ifndef  __ZXT_OBD_CLEAR_DTC_H__
#define  __ZXT_OBD_CLEAR_DTC_H__


#ifdef    CLEAR_DTC_VAR
#define   CLEAR_DTC_VAR_EXT
#else
#define   CLEAR_DTC_VAR_EXT  extern //变量声明
#endif

#ifdef    CLEAR_DTC_FUN
#define   CLEAR_DTC_FUN_EXT
#else
#define   CLEAR_DTC_FUN_EXT  extern//函数声明
#endif
/*
********************************************************************************
                              描述:清码数据类型声明
********************************************************************************
*/

/*
********************************************************************************
                            描述:清吗函数声明
********************************************************************************
*/
CLEAR_DTC_FUN_EXT void *pfun_cdtc_for_all_car( void *pArg0, void *pArg1 );
#endif


