
/*
********************************************************************************
File name  : ZXT_iso_9141.h
Description: 该头文件主要是ISO9141相关数据类型声明和相关函数声明
History    :
修改日期   : 修改者 : 修改内容:简单详述
2012-4-19    冯秋杰   建立9141程序变量和函数的声明
********************************************************************************
*/
#ifndef  __ZXT_OBD_ISO_9141_H__
#define  __ZXT_OBD_ISO_9141_H__


#ifdef    ISO_9141_FUN
#define   ISO_9141_FUN_EXT
#else
#define   ISO_9141_FUN_EXT  extern
#endif

#ifdef    ISO_9141_VAR
#define   ISO_9141_VAR_EXT
#else
#define   ISO_9141_VAR_EXT  extern
#endif
/*
********************************************************************************
                              描述:iso-9141数据类型声明
********************************************************************************
*/
/*
********************************************************************************
                              描述:iso-9141变量声明
********************************************************************************
*/
/*
********************************************************************************
                              描述:iso-9141函数声明
********************************************************************************
*/
ISO_9141_FUN_EXT void*pfun_iso_9141_68_check( void*pArg0, void*pArg1 );
ISO_9141_FUN_EXT void*pfun_iso_9141_send_command_group( void *pCmdId, void *prg1 );
ISO_9141_FUN_EXT void fun_iso_9141_send_times( uint8 cmdid, uint8 u8FrameLen, void **pCommStatus );
#endif

