/*
********************************************************************************
File name  : ZXT_fun_lib_Variable_init.c
Description: 该文件主要是整个funlib_c中变量的初始化，函数初始化化都是在分别的.c中
History    :
修改日期   : 修改者 : 修改内容:简单详述
2012-4-19    小老鼠   初始化底层需要的变量
修改日期   : 修改者 : 修改内容:简单详述
********************************************************************************
*/
#define  CREATE_LINK_VAR           //包含创建连接头文件
#define  CLEAR_DTC_VAR             //清码头文件
#define  DATA_STREAM_VAR           //数据流头文件
#define  READ_DTC_VAR              //读取故障码头文件
#define  GET_ODOMETER_VAR          //读取里程
#define  GET_VIN__VAR              //获取VIN码 
#include "../OBD_LIB/OBD_PUBLIC/Driver/Inc/zxt_obd_include.h"

/*
********************************************************************************
                              描述:整个系统与ECU通讯命令相关变量初始化
********************************************************************************
*/

uint8  g_u8ActiveFunVarOffset = 0;
static uint32 g_u32CalibrationOdo;

/*
********************************************************************************
                              描述:ISO-14230激活配置表(主要针对激活部分)
********************************************************************************
*/
#if CREATE_LINK_LOW_HIGH_25MS_EN==1//这里用来控制运用那个变量
const TYPEDEF_ISO14230_ACTIVE_PAR  g_stIso14230ActiveLib[] =
{
    {25, 25, 3, 10400}, //标准K线OBD通讯参数配置
};
#endif

/*
********************************************************************************
                              描述:ISO-9141激活配置表(主要针对激活部分)
********************************************************************************
*/

#if ACTIVE_5BAUD_INIT_EN==1
const TYPEDEF_ISO9141_ACTIVE_PAR  g_stIso9141ActiveLib[] =
{
    {0x33, 200, 2, 10400, {30, 30, 6000}}, //标准OBD
    //{0x01, 200, 2, 10400, {30, 30, 1000}}, //宝来车,2012捷达
};
#endif
/*
********************************************************************************
                              描述:K协议所需要参数配置(主要针对发送和接收部分)
********************************************************************************
*/
const TYPEDEF_ISO14230_COMMUNICATION_PAR g_stIsoKlineCommLib[] =
{
    7, 500, 3, 500   //标准OBD使用通讯参数,不建议P1使用该组参数(主要是因为帧时间太长)
};
/*
********************************************************************************
                              描述:ISO-IsoKline通讯参数配置表
********************************************************************************
*/

/*
********************************************************************************
                              描述:ISO-15765激活变量配置表
********************************************************************************
*/

//uint8  u8BaudRate;             //波特率
//uint8  u8FrameTime;            //CAN通讯帧时间
//uint16 u16TimeOut;             //CAN通讯超时时间
//uint8  u8RetransTime;          //重发次数
#if CREATE_LINK_CAN_BUS_EN==1
const TYPEDEF_ISO15765_ACTIVE_PAR g_stIso15765ActiveLib[] =
{
    {DEF_CAN500K, 20, 200,  2},//obd标准can,扩张can,宝来车
    //{DEF_CAN500K, 20, 1000, 2},//通用车协议
};
#endif

/*
********************************************************************************
                            描述:故障码变量配置表
故障码总数缓存地址
故障码总数字节
故障码号缓存地址
故障码号开始字节
故障码有效字节数(几个字节一个故障码)
多少个字节一个故障码
故障码类型
********************************************************************************
*/
//具有总数故障码配置表
const TYPEDEF_DTC_WITHITOTAL g_stDtcWithTotalConfigLib[] =
{
    {0, 1, 0, 2, 2, 2, 6}, //标准OBD-CAN
    //{0, 1, 0, 2, 3, 3, 6}, //宝来车读码
};

//没有总数故障码配置表

//故障码号缓存地址
//故障码号开始字节
//故障码有效字节数(几个字节一个故障码)
//多少个字节一个故障码
//码库选择
const TYPEDEF_DTC_NOTOTAL g_stDtcWithNoTotalConfigLib[] =
{
    {0, 1, 2, 2, 6}, //标准OBD-K线读码
    //{0, 0, 3, 3, 6}, //通用车-can线读码
    //{0, 1, 2, 3, 6}, //捷达车-K线读码
    //{0, 3, 4, 4, 2}, //宝来车-can线读码(变速箱)
};
/*
********************************************************************************
                            描述:数据流变量配置表
********************************************************************************
*/
const TYPEDEF_DATASTREAM_LIB g_pstDataStreamLib[] =
{
    {103, g_stObd0mode0DataStream},//0标准K线(高低电平激活,地址码激活)数据流
    {103, g_stObd0mode1DataStream},//168 6A数据流
    {103, g_stObd0mode1DataStream},//2标准CAN线数据流(7e8)
    {103, g_stObd0mode1DataStream},//3扩张CAN线数据流(7e9)
    {103, g_stObd0mode1DataStream},//4扩张CAN线数据流(7ef)
    {103, g_stObd0mode1DataStream},//5扩张CAN线数据流(0x18daf110)
    {103, g_stObd0mode1DataStream},//6扩张CAN线数据流(0x18daf111)
    {103, g_stObd0mode1DataStream},//7扩张CAN线数据流(0x18daf10e)

};

/*
********************************************************************************
                            描述:里程变量初始化
********************************************************************************
*/
TYPEDEF_BUS_ODO_PAR g_stOdoMeterLib[] =
{
    {0x5c5, 3, 300, FALSE},
};

/*
********************************************************************************
                            描述:VIN码获取
********************************************************************************
*/
TYPEDEF_VIN_PAR0 g_stVinLib[] =
{
    {0x03, 0x05, 0x0, 0x11},                                //CAN线
    {0x13, 0x05, 0x2, 0x04},                                //K线
};





